import {Component, signal} from '@angular/core';

@Component({
  selector: 'app-faq',
  imports: [],
  templateUrl: './faq.html',
  styleUrl: './faq.css',
})
export class Faq {
  // سیگنال برای ذخیره ایندکس سوالی که باز است (null یعنی همه بسته هستند)
  activeFaq = signal<number | null>(0); // پیش‌فرض سوال اول باز باشد

  toggleFaq(index: number) {
    this.activeFaq.update(current => current === index ? null : index);
  }

  faqs = [
    {
      question: 'ارسال سفارشات به چه صورت و چقدر زمان می‌برد؟',
      answer: 'ارسال سفارشات برون‌سپاری شده و به انتخاب شما از طریق <strong>تیپاکس</strong> یا <strong>پست ایران</strong> به سراسر کشور انجام می‌شود. <br> <span class="text-porcelain-400 font-bold">ویژه مشتریان شیراز:</span> با توجه به استقرار نمایندگی اصلی اُتکس در شیراز، سفارشات شهر شیراز در <strong>کمتر از ۲۴ ساعت</strong> به دست شما خواهد رسید.'
    },
    {
      question: 'آیا لنت‌ها ضمانت اصالت و امکان مرجوعی دارند؟',
      answer: 'بله، تمامی محصولات با <strong>ضمانت قطعی اصالت کالا</strong> عرضه می‌شوند. همچنین جهت آسودگی خاطر شما، در صورت باز نشدن پلمپ محصول، تا <strong>۷ روز</strong> امکان مرجوع کردن کالا بدون قید و شرط وجود دارد.'
    },
    {
      question: 'چگونه لنت مناسب (جلو/عقب یا دیسکی/کفشکی) را تشخیص دهم؟',
      answer: 'ما فرآیند انتخاب را برای شما مهندسی کرده‌ایم! در کارت هر محصول و صفحه جزئیات آن، <strong>سمت نصب لنت (جلو یا عقب)</strong> و <strong>نوع آن (دیسکی یا کفشکی)</strong> با لیبل‌های مشخص و درشت درج شده است. همچنین لیست کامل خودروهای سازگار در صفحه محصول قرار دارد.'
    },
    {
      question: 'آیا امکان خرید حضوری محصولات اُتکس وجود دارد؟',
      answer: 'بله علاوه بر فروشگاه آنلاین، افتخار میزبانی از شما در شعبه حضوری را نیز داریم. <br> <strong>آدرس شعبه شیراز:</strong> شیراز، خیابان سعدی، فروشگاه <strong>پژو پارت</strong>.'
    }
  ];
}
